package com.fitbot.config.consts

val ALREADY_EXISTS = "Мы с тобой уже познакомились! Ну можно еще раз...)\nЕсли хотите, вы можете отредактировать профиль еще раз.\nВоспользуетесь командой /myprofile."
val HELLO_MSG = "Привет! С нами вы полюбите кушать салатики...\nПройдем регистрацию?"

val REGISTRATION_CMD = "Пройти регистрацию"
val AWAY_CMD = "Пройду потом"
val WELCOME = "Добро пожаловать в FitBot!\nВоспользуйтесь командой /myprofile для редактирования профиля.\nВоспользуйтесь командой /makeorder для заказа."
